zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/atdf/PIC32CK1012SG00064.atdf
          <instance name="SERCOM2">
            <register-group name="SERCOM2" name-in-module="SERCOM" address-space="base" offset="0x44814000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PC11" ioset="1 3"/>
              <signal group="PAD" index="0" function="C" pad="PC06" ioset="4"/>
              <signal group="PAD" index="1" function="D" pad="PC10" ioset="1 3"/>
              <signal group="PAD" index="1" function="C" pad="PC07" ioset="4"/>
              <signal group="PAD" index="2" function="D" pad="PC05" ioset="3"/>
              <signal group="PAD" index="2" function="D" pad="PC12" ioset="1"/>
              <signal group="PAD" index="2" function="C" pad="PC09" ioset="4"/>
              <signal group="PAD" index="3" function="D" pad="PC02" ioset="3"/>
              <signal group="PAD" index="3" function="D" pad="PC13" ioset="1"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="9" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="10" caption="Index of DMA TX trigger"/>
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?"/>
              <param name="FIFO_SIZE" value="8" caption="Rx-Tx FIFO size in bytes"/>
              <param name="FSYNC_IMPLEMENTED" value="1" caption="SPI Frame Synch mode implemented?"/>
              <param name="GCLK_ID_CORE" value="21"/>
              <param name="GCLK_ID_SLOW" value="18"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="1" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="1" caption="TWI HighSpeed mode implemented?"/>
              <param name="ULTRA_IMPLEMENTATION" value="0" caption="ULTRA platform compatibility?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="INSTANCE_ID" value="42" caption="Instance index for SERCOM2"/>
              <param name="MCLK_ID_APB" value="73" caption="Index for SERCOM2 APB clock"/>
              <param name="PAC_ID" value="42" caption="Index for SERCOM2 registers write protection"/>
              <param name="USART_ERROR_INT_SRC" value="56" caption="USART/SPI/I2C Error"/>
              <param name="USART_TX_READY_INT_SRC" value="57" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="58" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
              <param name="USART_RX_INT_SRC" value="59" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="SPI_TX_READY_INT_SRC" value="57" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="58" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
              <param name="SPI_RX_INT_SRC" value="59" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="I2C_0_INT_SRC" value="56" caption="USART/SPI/I2C Error"/>
              <param name="I2C_1_INT_SRC" value="59" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="I2C_2_INT_SRC" value="60" caption="USART Receive Start/ SPI Slave Select Low/ I2C TX FIFO Empty"/>
              <param name="I2C_3_INT_SRC" value="61" caption="USART Clear To Send Input Change/ I2C RX FIFO Full"/>
            </parameters>
          </instance>
          <instance name="SERCOM3">
            <register-group name="SERCOM3" name-in-module="SERCOM" address-space="base" offset="0x44816000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PC07" ioset="4"/>
              <signal group="PAD" index="0" function="C" pad="PC02" ioset="1"/>
              <signal group="PAD" index="1" function="D" pad="PC06" ioset="4"/>
              <signal group="PAD" index="1" function="C" pad="PC03" ioset="1"/>
              <signal group="PAD" index="2" function="D" pad="PC01" ioset="4"/>
              <signal group="PAD" index="2" function="D" pad="PC09" ioset="4"/>
              <signal group="PAD" index="2" function="C" pad="PB07" ioset="2"/>
              <signal group="PAD" index="2" function="C" pad="PC04" ioset="1"/>
              <signal group="PAD" index="3" function="D" pad="PC00" ioset="4"/>
              <signal group="PAD" index="3" function="C" pad="PB08" ioset="2"/>
              <signal group="PAD" index="3" function="C" pad="PC05" ioset="1"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="11" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="12" caption="Index of DMA TX trigger"/>
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?"/>
              <param name="FIFO_SIZE" value="8" caption="Rx-Tx FIFO size in bytes"/>
              <param name="FSYNC_IMPLEMENTED" value="1" caption="SPI Frame Synch mode implemented?"/>
              <param name="GCLK_ID_CORE" value="22"/>
              <param name="GCLK_ID_SLOW" value="18"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="1" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="1" caption="TWI HighSpeed mode implemented?"/>
              <param name="ULTRA_IMPLEMENTATION" value="0" caption="ULTRA platform compatibility?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="INSTANCE_ID" value="43" caption="Instance index for SERCOM3"/>
              <param name="MCLK_ID_APB" value="74" caption="Index for SERCOM3 APB clock"/>
              <param name="PAC_ID" value="43" caption="Index for SERCOM3 registers write protection"/>
              <param name="USART_ERROR_INT_SRC" value="62" caption="USART/SPI/I2C Error"/>
              <param name="USART_TX_READY_INT_SRC" value="63" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="64" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
              <param name="USART_RX_INT_SRC" value="65" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="SPI_TX_READY_INT_SRC" value="63" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="64" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
              <param name="SPI_RX_INT_SRC" value="65" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="I2C_0_INT_SRC" value="62" caption="USART/SPI/I2C Error"/>
              <param name="I2C_1_INT_SRC" value="65" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="I2C_2_INT_SRC" value="66" caption="USART Receive Start/ SPI Slave Select Low/ I2C TX FIFO Empty"/>
              <param name="I2C_3_INT_SRC" value="67" caption="USART Clear To Send Input Change/ I2C RX FIFO Full"/>
            </parameters>
          </instance>
          <instance name="SERCOM4">
            <register-group name="SERCOM4" name-in-module="SERCOM" address-space="base" offset="0x45000000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PB04" ioset="2"/>
              <signal group="PAD" index="0" function="D" pad="PB10" ioset="4"/>
              <signal group="PAD" index="0" function="C" pad="PB04" ioset="2"/>
              <signal group="PAD" index="0" function="C" pad="PB09" ioset="1"/>
              <signal group="PAD" index="1" function="D" pad="PB05" ioset="2"/>
              <signal group="PAD" index="1" function="D" pad="PB09" ioset="4"/>
              <signal group="PAD" index="1" function="C" pad="PB05" ioset="2"/>
              <signal group="PAD" index="1" function="C" pad="PB10" ioset="1"/>
              <signal group="PAD" index="2" function="D" pad="PA10" ioset="2"/>
              <signal group="PAD" index="2" function="D" pad="PB07" ioset="4"/>
              <signal group="PAD" index="2" function="C" pad="PC00" ioset="1"/>
              <signal group="PAD" index="3" function="D" pad="PB06" ioset="2"/>
              <signal group="PAD" index="3" function="D" pad="PB08" ioset="4"/>
              <signal group="PAD" index="3" function="C" pad="PB06" ioset="2"/>
              <signal group="PAD" index="3" function="C" pad="PC01" ioset="1"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="41" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="42" caption="Index of DMA TX trigger"/>
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?"/>
              <param name="FIFO_SIZE" value="8" caption="Rx-Tx FIFO size in bytes"/>
              <param name="FSYNC_IMPLEMENTED" value="1" caption="SPI Frame Synch mode implemented?"/>
              <param name="GCLK_ID_CORE" value="25"/>
              <param name="GCLK_ID_SLOW" value="18"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="1" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="1" caption="TWI HighSpeed mode implemented?"/>
              <param name="ULTRA_IMPLEMENTATION" value="0" caption="ULTRA platform compatibility?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="INSTANCE_ID" value="64" caption="Instance index for SERCOM4"/>
              <param name="MCLK_ID_APB" value="96" caption="Index for SERCOM4 APB clock"/>
              <param name="PAC_ID" value="64" caption="Index for SERCOM4 registers write protection"/>
              <param name="USART_ERROR_INT_SRC" value="96" caption="USART/SPI/I2C Error"/>
              <param name="USART_TX_READY_INT_SRC" value="97" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="98" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
              <param name="USART_RX_INT_SRC" value="99" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="SPI_TX_READY_INT_SRC" value="97" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="98" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
              <param name="SPI_RX_INT_SRC" value="99" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="I2C_0_INT_SRC" value="96" caption="USART/SPI/I2C Error"/>
              <param name="I2C_1_INT_SRC" value="99" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="I2C_2_INT_SRC" value="100" caption="USART Receive Start/ SPI Slave Select Low/ I2C TX FIFO Empty"/>
              <param name="I2C_3_INT_SRC" value="101" caption="USART Clear To Send Input Change/ I2C RX FIFO Full"/>
            </parameters>
          </instance>
          <instance name="SERCOM5">
            <register-group name="SERCOM5" name-in-module="SERCOM" address-space="base" offset="0x45002000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA05" ioset="4"/>
              <signal group="PAD" index="0" function="C" pad="PA11" ioset="1"/>
              <signal group="PAD" index="1" function="D" pad="PA06" ioset="4"/>
              <signal group="PAD" index="1" function="C" pad="PA12" ioset="1"/>
              <signal group="PAD" index="2" function="D" pad="PA07" ioset="4"/>
              <signal group="PAD" index="2" function="C" pad="PB00" ioset="1"/>
              <signal group="PAD" index="3" function="D" pad="PA08" ioset="4"/>
              <signal group="PAD" index="3" function="C" pad="PB01" ioset="1"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="43" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="44" caption="Index of DMA TX trigger"/>
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?"/>
              <param name="FIFO_SIZE" value="8" caption="Rx-Tx FIFO size in bytes"/>
              <param name="FSYNC_IMPLEMENTED" value="1" caption="SPI Frame Synch mode implemented?"/>
              <param name="GCLK_ID_CORE" value="26"/>
              <param name="GCLK_ID_SLOW" value="18"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="TWIM" value="1" caption="TWI Master mode implemented?"/>
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?"/>
              <param name="TWI_HSMODE" value="1" caption="TWI HighSpeed mode implemented?"/>
              <param name="ULTRA_IMPLEMENTATION" value="0" caption="ULTRA platform compatibility?"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="INSTANCE_ID" value="65" caption="Instance index for SERCOM5"/>
              <param name="MCLK_ID_APB" value="97" caption="Index for SERCOM5 APB clock"/>
              <param name="PAC_ID" value="65" caption="Index for SERCOM5 registers write protection"/>
              <param name="USART_ERROR_INT_SRC" value="102" caption="USART/SPI/I2C Error"/>
              <param name="USART_TX_READY_INT_SRC" value="103" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="104" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
              <param name="USART_RX_INT_SRC" value="105" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="SPI_TX_READY_INT_SRC" value="103" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="104" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
              <param name="SPI_RX_INT_SRC" value="105" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="I2C_0_INT_SRC" value="102" caption="USART/SPI/I2C Error"/>
              <param name="I2C_1_INT_SRC" value="105" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
              <param name="I2C_2_INT_SRC" value="106" caption="USART Receive Start/ SPI Slave Select Low/ I2C TX FIFO Empty"/>
              <param name="I2C_3_INT_SRC" value="107" caption="USART Clear To Send Input Change/ I2C RX FIFO Full"/>
            </parameters>
          </instance>
        </module>
        <module name="SPI_IXS" id="03574" name2="spi_ixs_apb_v1" version="1a0">
          <instance name="SPI_IXS">
            <register-group name="SPI_IXS" name-in-module="SPI_IXS" address-space="base" offset="0x45016000"/>
            <signals>
              <signal group="FSYNC" function="J" pad="PA09" ioset="2"/>
              <signal group="FSYNC" function="J" pad="PD06" ioset="1"/>
              <signal group="SCK" function="J" pad="PA11" ioset="2"/>
              <signal group="SCK" function="J" pad="PD10" ioset="1"/>
              <signal group="SDI" function="J" pad="PA12" ioset="2"/>
              <signal group="SDI" function="J" pad="PD07" ioset="1"/>
              <signal group="SDO" function="J" pad="PB00" ioset="2"/>
              <signal group="SDO" function="J" pad="PD08" ioset="1"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="65"/>
              <param name="DMAC_ID_TX" value="66"/>
              <param name="GCLK_ID" value="36" caption="Index of Generic Clock"/>
              <param name="TPD_MASTER" value="0" caption="Indicates a master or slave number for TPD mode( 1=master,0=slave)"/>
              <param name="INSTANCE_ID" value="75" caption="Instance index for SPI_IXS"/>
              <param name="MCLK_ID_APB" value="107" caption="Index for SPI_IXS APB clock"/>
              <param name="PAC_ID" value="75" caption="Index for SPI_IXS registers write protection"/>
            </parameters>
          </instance>
        </module>
