zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/atdf/PIC32CK1012SG00064.atdf
        <module name="SQI" id="04044" name2="sqi_ctlr_v4" version="4b0">
          <instance name="SQI">
            <register-group name="SQI" name-in-module="SQI" address-space="base" offset="0x0FFFF000"/>
            <signals>
              <signal group="CLK" function="P" pad="PC06" ioset="2"/>
              <signal group="CLK" function="H" pad="PD10" ioset="1"/>
              <signal group="CS" index="0" function="P" pad="PC01" ioset="2"/>
              <signal group="CS" index="0" function="H" pad="PD06" ioset="1"/>
              <signal group="CS" index="1" function="P" pad="PC00" ioset="2"/>
              <signal group="CS" index="1" function="H" pad="PD05" ioset="1"/>
              <signal group="CS" index="2" function="H" pad="PA10" ioset="1"/>
              <signal group="DATA" index="0" function="P" pad="PC02" ioset="2"/>
              <signal group="DATA" index="0" function="H" pad="PD07" ioset="1"/>
              <signal group="DATA" index="1" function="P" pad="PC07" ioset="2"/>
              <signal group="DATA" index="1" function="H" pad="PD11" ioset="1"/>
              <signal group="DATA" index="2" function="P" pad="PC03" ioset="2"/>
              <signal group="DATA" index="2" function="H" pad="PD08" ioset="1"/>
              <signal group="DATA" index="3" function="P" pad="PC05" ioset="2"/>
              <signal group="DATA" index="3" function="H" pad="PD09" ioset="1"/>
            </signals>
            <parameters>
              <param name="ATSPEED_IMPLEMENTED" value="1"/>
              <param name="CBUF_DEPTH" value="3"/>
              <param name="GCLK_ID" value="43" caption="Index of Generic Clock"/>
              <param name="SFR_ADDRESS" value="0x0ffff000"/>
              <param name="TRXBUF_DEPTH" value="8"/>
              <param name="XIP_ADDRESS" value="0x10"/>
              <param name="XIP_CS_MSB" value="3"/>
              <param name="XIP_HSEL" value="1"/>
              <param name="INSTANCE_ID" value="96" caption="Instance index for SQI"/>
              <param name="MCLK_ID_AHB" value="16" caption="Index for SQI AHB clock"/>
              <param name="PAC_ID" value="96" caption="Index for SQI registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="SUPC" id="03926" name2="pwr_rpmu_supc_v1" version="1c0">
          <instance name="SUPC">
            <register-group name="SUPC" name-in-module="SUPC" address-space="base" offset="0x44008000"/>
            <signals>
              <signal group="ATEST_ANA" function="default" pad="ATEST_ANA"/>
            </signals>
            <parameters>
              <param name="ADDVREG_NUM" value="1" caption="Number of additional capless regulators for USB, PLL, ..."/>
              <param name="ADDVREG_PLL_NUM" value="0" caption="Number of additional capless regulators dedicated to PLL(s) (between 0 and ADDVREG_NUM)"/>
              <param name="ADDVREG_PLL_START_INDEX" value="1" caption="Index of the first additional capless regulator dedicated to a PLL within [ADDVREG_NUM-1:0] range. Must be equal to 1 if ADDVREG_PLL_NUM=0."/>
              <param name="BKOUT_NUM" value="2" caption="Number of BKOUT output pin"/>
              <param name="BORVDDUSB_NUM" value="1" caption="Number of BOR_USB"/>
              <param name="CHRG_PUMP_NUM" value="2" caption="Number of Charge Pump"/>
              <param name="IOB_IMPLEMENTED" value="1" caption="one if IOB feature is implemented"/>
              <param name="RPMU_DEVICE_TYP" value="OTHERS" caption="Defines the device name this macro is being instantiated in. Will control any register differences between devices."/>
              <param name="USER_LDO_IMPLEMENTED" value="0" caption="one if USER_LDO feature is implemented"/>
              <param name="VBAT_IMPLEMENTED" value="1" caption="one if VBAT feature (battery backup feature) is implemented."/>
              <param name="VREGSW_NUM" value="3" caption="Number of main voltage regulator (100mA). Example: 1 for Unicorn, 4 for Riverside."/>
              <param name="INSTANCE_ID" value="4" caption="Instance index for SUPC"/>
              <param name="MCLK_ID_APB" value="36" caption="Index for SUPC APB clock"/>
              <param name="PAC_ID" value="4" caption="Index for SUPC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="SysTick" id="SYSTEM_IP" version="1.0.0">
          <instance name="SysTick">
            <register-group name="SysTick" name-in-module="SysTick" address-space="base" offset="0xE000E010"/>
          </instance>
          <instance name="SysTick_NS">
            <register-group name="SysTick_NS" name-in-module="SysTick" address-space="base" offset="0xE002E010"/>
            <parameters>
              <param name="__SYST_NUM" value="2" caption="Number of implemented SysTick timers"/>
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="03610" name2="tmr_tcc_u2213_v4" version="4d0">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x44818000"/>
            <signals>
              <signal group="WO" index="0" function="G" pad="PB10" ioset="2"/>
              <signal group="WO" index="0" function="F" pad="PB04" ioset="1"/>
              <signal group="WO" index="1" function="G" pad="PC00" ioset="2"/>
              <signal group="WO" index="1" function="F" pad="PB05" ioset="1"/>
              <signal group="WO" index="2" function="G" pad="PC01" ioset="2"/>
              <signal group="WO" index="3" function="G" pad="PC02" ioset="2"/>
              <signal group="WO" index="3" function="F" pad="PB06" ioset="1"/>
              <signal group="WO" index="4" function="G" pad="PC03" ioset="2"/>
              <signal group="WO" index="5" function="G" pad="PC04" ioset="2"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="6" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="14" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="15" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_MC_2" value="16" caption="Indexes of DMA Match/Compare triggers 2"/>
              <param name="DMAC_ID_MC_3" value="17" caption="Indexes of DMA Match/Compare triggers 3"/>
              <param name="DMAC_ID_MC_4" value="18" caption="Indexes of DMA Match/Compare triggers 4"/>
              <param name="DMAC_ID_MC_5" value="19" caption="Indexes of DMA Match/Compare triggers 5"/>
              <param name="DMAC_ID_OVF" value="13" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="23" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="32"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="44" caption="Instance index for TCC0"/>
              <param name="MCLK_ID_APB" value="75" caption="Index for TCC0 APB clock"/>
              <param name="PAC_ID" value="44" caption="Index for TCC0 registers write protection"/>
            </parameters>
          </instance>
          <instance name="TCC1">
            <register-group name="TCC1" name-in-module="TCC" address-space="base" offset="0x4481A000"/>
            <signals>
              <signal group="WO" index="0" function="G" pad="PC05" ioset="2"/>
              <signal group="WO" index="1" function="G" pad="PC06" ioset="2"/>
              <signal group="WO" index="2" function="G" pad="PC07" ioset="2"/>
              <signal group="WO" index="3" function="G" pad="PC09" ioset="2"/>
              <signal group="WO" index="5" function="G" pad="PC10" ioset="2"/>
              <signal group="WO" index="6" function="G" pad="PC11" ioset="2"/>
              <signal group="WO" index="7" function="G" pad="PC12" ioset="2"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="6" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="21" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="22" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_MC_2" value="23" caption="Indexes of DMA Match/Compare triggers 2"/>
              <param name="DMAC_ID_MC_3" value="24" caption="Indexes of DMA Match/Compare triggers 3"/>
              <param name="DMAC_ID_MC_4" value="25" caption="Indexes of DMA Match/Compare triggers 4"/>
              <param name="DMAC_ID_MC_5" value="26" caption="Indexes of DMA Match/Compare triggers 5"/>
              <param name="DMAC_ID_OVF" value="20" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="23" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="32"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="45" caption="Instance index for TCC1"/>
              <param name="MCLK_ID_APB" value="76" caption="Index for TCC1 APB clock"/>
              <param name="PAC_ID" value="45" caption="Index for TCC1 registers write protection"/>
            </parameters>
          </instance>
