zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/atdf/PIC32CK1012SG00064.atdf
      <value-group name="TYPE__CLSIZE">
        <value name="CLSIZE_4B" caption="Cache Line Size is 4 bytes" value="0"/>
        <value name="CLSIZE_8B" caption="Cache Line Size is 8 bytes" value="1"/>
        <value name="CLSIZE_16B" caption="Cache Line Size is 16 bytes" value="2"/>
        <value name="CLSIZE_32B" caption="Cache Line Size is 32 bytes" value="3"/>
        <value name="CLSIZE_64B" caption="Cache Line Size is 64 bytes" value="4"/>
        <value name="CLSIZE_128B" caption="Cache Line Size is 128 bytes" value="5"/>
      </value-group>
      <value-group name="CFG__CSIZESW">
        <value name="CONF_CSIZE_1KB" caption="The Cache Size is configured to 1KB" value="0"/>
        <value name="CONF_CSIZE_2KB" caption="The Cache Size is configured to 2KB" value="1"/>
        <value name="CONF_CSIZE_4KB" caption="The Cache Size is configured to 4KB" value="2"/>
        <value name="CONF_CSIZE_8KB" caption="The Cache Size is configured to 8KB" value="3"/>
        <value name="CONF_CSIZE_16KB" caption="The Cache Size is configured to 16KB" value="4"/>
        <value name="CONF_CSIZE_32KB" caption="The Cache Size is configured to 32KB" value="5"/>
        <value name="CONF_CSIZE_64KB" caption="The Cache Size is configured to 64KB" value="6"/>
      </value-group>
      <value-group name="MAINT1__WAY">
        <value name="WAY0" caption="Way 0 is selection for index invalidation" value="0"/>
        <value name="WAY1" caption="Way 1 is selection for index invalidation" value="1"/>
        <value name="WAY2" caption="Way 2 is selection for index invalidation" value="2"/>
        <value name="WAY3" caption="Way 3 is selection for index invalidation" value="3"/>
      </value-group>
      <value-group name="MCFG__MODE">
        <value name="CYCLE_COUNT" caption="Cycle counter" value="0"/>
        <value name="IHIT_COUNT" caption="Instruction hit counter" value="1"/>
        <value name="DHIT_COUNT" caption="Data hit counter" value="2"/>
      </value-group>
    </module>
    <module name="CoreDebug" id="SYSTEM_IP" version="1.0.0" caption="Debug Control Block">
      <register-group name="CoreDebug" caption="Debug Control Block">
        <register name="DHCSR" offset="0x0" rw="RW" size="4" access-size="4" caption="Debug Halting Control and Status Register">
          <bitfield name="C_DEBUGEN" caption="Enable Halting debug" mask="0x1"/>
          <bitfield name="C_HALT" caption="Halt processor" mask="0x2"/>
          <bitfield name="C_STEP" caption="Enable single step" mask="0x4"/>
          <bitfield name="C_MASKINTS" caption="Mask PendSV, SysTick and external configurable interrupts" mask="0x8"/>
          <bitfield name="S_SNAPSTALL" caption="Snap stall control" mask="0x20"/>
          <bitfield name="S_REGRDY" caption="Register ready status" mask="0x10000"/>
          <bitfield name="S_HALT" caption="Halted status" mask="0x20000"/>
          <bitfield name="S_SLEEP" caption="Sleeping status" mask="0x40000"/>
          <bitfield name="S_LOCKUP" caption="Lockup status" mask="0x80000"/>
          <bitfield name="S_SDE" caption="Secure debug enabled" mask="0x100000"/>
          <bitfield name="S_RETIRE_ST" caption="Retire sticky status" mask="0x1000000"/>
          <bitfield name="S_RESET_ST" caption="Reset sticky status" mask="0x2000000"/>
          <bitfield name="S_RESTART_ST" caption="Restart sticky status" mask="0x4000000"/>
        </register>
        <register name="DCRSR" offset="0x4" rw="W" size="4" access-size="4" caption="Debug Core Register Select Register">
          <bitfield name="REGSEL" caption="Register selector" mask="0x7F"/>
          <bitfield name="REGWnR" caption="Register write/not-read access" mask="0x10000"/>
        </register>
        <register name="DCRDR" offset="0x8" rw="RW" size="4" access-size="4" caption="Debug Core Register Data Register">
          <bitfield name="DBGTMP" caption="Data temporary buffer" mask="0xFFFFFFFF"/>
        </register>
        <register name="DEMCR" offset="0xC" rw="RW" size="4" access-size="4" caption="Debug Exception and Monitor Control Register">
          <bitfield name="VC_CORERESET" caption="Core reset Halting debug vector catch enable" mask="0x1"/>
          <bitfield name="VC_MMERR" caption="MemManage exception Halting debug vector catch enable" mask="0x10"/>
          <bitfield name="VC_NOCPERR" caption="UsageFault exception coprocessor access Halting debug vector catch enable" mask="0x20"/>
          <bitfield name="VC_CHKERR" caption="UsageFault exception checking error Halting debug vector catch enable" mask="0x40"/>
          <bitfield name="VC_STATERR" caption="UsageFault exception state information error Halting debug vector catch enable" mask="0x80"/>
          <bitfield name="VC_BUSERR" caption="BusFault exception Halting debug vector catch enable" mask="0x100"/>
          <bitfield name="VC_INTERR" caption="Excception entry and return faults Halting debug vector catch enable" mask="0x200"/>
          <bitfield name="VC_HARDERR" caption="HardFault exception Halting debug vector catch enable" mask="0x400"/>
          <bitfield name="VC_SFERR" caption="SecureFault exception Halting debug vector catch enable" mask="0x800"/>
          <bitfield name="MON_EN" caption="DebugMonitor enable" mask="0x10000"/>
          <bitfield name="MON_PEND" caption="DebugMonitor pending state" mask="0x20000"/>
          <bitfield name="MON_STEP" caption="Enable DebugMonitor stepping" mask="0x40000"/>
          <bitfield name="MON_REQ" caption="DebugMonitor semaphore bit" mask="0x80000"/>
          <bitfield name="SDME" caption="Secure DebugMonitor enable" mask="0x100000"/>
          <bitfield name="TRCENA" caption="Global DWT and ITM features enable" mask="0x1000000"/>
        </register>
        <register name="DAUTHCTRL" offset="0x14" rw="RW" size="4" access-size="4" caption="Debug Authentication Control Register">
          <bitfield name="SPIDENSEL" caption="Secure invasive debug enable select" mask="0x1"/>
          <bitfield name="INTSPIDEN" caption="Internal Secure invasive debug enable" mask="0x2"/>
          <bitfield name="SPNIDENSEL" caption="Secure non-invasive debug enable select" mask="0x4"/>
          <bitfield name="INTSPNIDEN" caption="Internal Secure non-invasive debug enable" mask="0x8"/>
        </register>
        <register name="DSCSR" offset="0x18" rw="RW" size="4" access-size="4" caption="Debug Security Control and Status Register">
          <bitfield name="SBRSELEN" caption="Secure Banked register select enable" mask="0x1"/>
          <bitfield name="SBRSEL" caption="Secure Banked register select" mask="0x2"/>
          <bitfield name="CDS" caption="Current domain Secure" mask="0x10000"/>
          <bitfield name="CDSKEY" caption="CDS field write-enable key" mask="0x20000"/>
        </register>
      </register-group>
    </module>
    <module name="DIB" id="SYSTEM_IP" version="1.0.0" caption="Debug Identification Block">
      <register-group name="DIB" caption="Debug Identification Block">
        <register name="DLAR" offset="0x0" rw="W" size="4" access-size="4" caption="SCS Software Lock Access Register">
          <bitfield name="KEY" caption="Lock access control" mask="0xFFFFFFFF" values="DLAR__KEY"/>
        </register>
        <register name="DLSR" offset="0x4" rw="R" size="4" access-size="4" caption="SCS Software Lock Status Register">
          <bitfield name="SLI" caption="Software Lock implemented" mask="0x1"/>
          <bitfield name="SLK" caption="Software Lock status" mask="0x2"/>
          <bitfield name="nTT" caption="Not thirty-two bit" mask="0x4"/>
        </register>
